
import imagePath from '../images/vat.png'

const data = [
  {
    isexample: true,
    taskId: 'U2024011016570597',
    status: 1,
    fileName: 'vat.png',
    imagePath,
    height: 3024,
    width: 4032,
    content: [
      {
        info: [
          {
            id: 1,
            key: '发票代码',
            position: [
              [
                {
                  x: 645,
                  y: 641
                },
                {
                  x: 1246,
                  y: 641
                },
                {
                  x: 1246,
                  y: 747
                },
                {
                  x: 645,
                  y: 747
                }
              ]
            ],
            value: '5000202130'
          },
          {
            id: 2,
            key: '发票号码',
            position: [
              [
                {
                  x: 2638,
                  y: 615
                },
                {
                  x: 3620,
                  y: 615
                },
                {
                  x: 3620,
                  y: 803
                },
                {
                  x: 2638,
                  y: 803
                }
              ]
            ],
            value: '07807193'
          },
          {
            id: 3,
            key: '发票日期',
            position: [
              [
                {
                  x: 3050,
                  y: 833
                },
                {
                  x: 3511,
                  y: 833
                },
                {
                  x: 3511,
                  y: 904
                },
                {
                  x: 3050,
                  y: 904
                }
              ]
            ],
            value: '2021年06月05日'
          },
          {
            id: 4,
            key: '校验码（后六位）',
            position: [
              []
            ],
            value: ''
          },
          {
            id: 5,
            key: '购买方名称',
            position: [
              [
                {
                  x: 848,
                  y: 990
                },
                {
                  x: 1612,
                  y: 990
                },
                {
                  x: 1612,
                  y: 1061
                },
                {
                  x: 848,
                  y: 1061
                }
              ]
            ],
            value: '重庆龙湖嘉博地产发展有限公司'
          },
          {
            id: 6,
            key: '购买方纳税人识别号',
            position: [
              [
                {
                  x: 852,
                  y: 1080
                },
                {
                  x: 1616,
                  y: 1080
                },
                {
                  x: 1616,
                  y: 1148
                },
                {
                  x: 852,
                  y: 1148
                }
              ]
            ],
            value: '915000000682569262'
          },
          {
            id: 7,
            key: '购买方地址及电话',
            position: [
              [
                {
                  x: 848,
                  y: 1173
                },
                {
                  x: 2039,
                  y: 1173
                },
                {
                  x: 2039,
                  y: 1241
                },
                {
                  x: 848,
                  y: 1241
                }
              ]
            ],
            value: '重庆市沙坪坝区西永大道28-2号023-67700627'
          },
          {
            id: 8,
            key: '购买方开户行及账号',
            position: [
              [
                {
                  x: 848,
                  y: 1263
                },
                {
                  x: 1904,
                  y: 1263
                },
                {
                  x: 1904,
                  y: 1335
                },
                {
                  x: 848,
                  y: 1335
                }
              ]
            ],
            value: '招商银行重庆江北支行123905776210902'
          },
          {
            id: 9,
            key: '销售方名称',
            position: [
              [
                {
                  x: 863,
                  y: 2233
                },
                {
                  x: 1459,
                  y: 2233
                },
                {
                  x: 1459,
                  y: 2305
                },
                {
                  x: 863,
                  y: 2305
                }
              ]
            ],
            value: '重庆市皇甫物资有限公司'
          },
          {
            id: 10,
            key: '销售方纳税人识别号',
            position: [
              [
                {
                  x: 867,
                  y: 2312
                },
                {
                  x: 1631,
                  y: 2312
                },
                {
                  x: 1631,
                  y: 2380
                },
                {
                  x: 867,
                  y: 2380
                }
              ]
            ],
            value: '91500106094325593N'
          },
          {
            id: 11,
            key: '销售方地址及电话',
            position: [
              [
                {
                  x: 867,
                  y: 2383
                },
                {
                  x: 2159,
                  y: 2383
                },
                {
                  x: 2159,
                  y: 2484
                },
                {
                  x: 867,
                  y: 2484
                }
              ]
            ],
            value: '重庆市沙坪坝区国际物流枢纽园重铁巨龙钢材市场B区4号楼10213594089818'
          },
          {
            id: 12,
            key: '销售方开户行及账号',
            position: [
              [
                {
                  x: 867,
                  y: 2484
                },
                {
                  x: 2081,
                  y: 2484
                },
                {
                  x: 2081,
                  y: 2552
                },
                {
                  x: 867,
                  y: 2552
                }
              ]
            ],
            value: '建行沙坪坝支行上桥分理处50001053700059168168'
          },
          {
            id: 13,
            key: '不含税总金额',
            position: [
              [
                {
                  x: 2620,
                  y: 1990
                },
                {
                  x: 2960,
                  y: 1990
                },
                {
                  x: 2960,
                  y: 2054
                },
                {
                  x: 2620,
                  y: 2054
                }
              ]
            ],
            value: '97062.88'
          },
          {
            id: 14,
            key: '总税额',
            position: [
              [
                {
                  x: 3290,
                  y: 1990
                },
                {
                  x: 3620,
                  y: 1990
                },
                {
                  x: 3620,
                  y: 2042
                },
                {
                  x: 3290,
                  y: 2042
                }
              ]
            ],
            value: '12618.17'
          },
          {
            id: 15,
            key: '价税合计大写',
            position: [
              [
                {
                  x: 1245,
                  y: 2102
                },
                {
                  x: 2069,
                  y: 2102
                },
                {
                  x: 2069,
                  y: 2178
                },
                {
                  x: 1245,
                  y: 2178
                }
              ]
            ],
            value: '壹拾万玖仟陆佰捌拾壹圆零伍分'
          },
          {
            id: 16,
            key: '价税合计小写',
            position: [
              [
                {
                  x: 2957,
                  y: 2099
                },
                {
                  x: 3361,
                  y: 2099
                },
                {
                  x: 3361,
                  y: 2162
                },
                {
                  x: 2957,
                  y: 2162
                }
              ]
            ],
            value: '109681.05'
          },
          {
            id: 17,
            key: '密码区',
            position: [
              [
                {
                  x: 2327,
                  y: 975
                },
                {
                  x: 3530,
                  y: 975
                },
                {
                  x: 3530,
                  y: 1305
                },
                {
                  x: 2327,
                  y: 1305
                }
              ]
            ],
            value: '03-5*1*33-76*>883*4725-*-<-029><506>4<>>+6**37++->91-4613*94+048627092<214426/6>/4>9300-0>04<101188/0376/873><46'
          },
          {
            id: 18,
            key: '收款人',
            position: [
              [
                {
                  x: 631,
                  y: 2574
                },
                {
                  x: 830,
                  y: 2574
                },
                {
                  x: 830,
                  y: 2653
                },
                {
                  x: 631,
                  y: 2653
                }
              ]
            ],
            value: '李超逸'
          },
          {
            id: 19,
            key: '复核',
            position: [
              [
                {
                  x: 1485,
                  y: 2567
                },
                {
                  x: 1687,
                  y: 2567
                },
                {
                  x: 1687,
                  y: 2649
                },
                {
                  x: 1485,
                  y: 2649
                }
              ]
            ],
            value: '陈俊甫'
          },
          {
            id: 20,
            key: '开票人',
            position: [
              [
                {
                  x: 2268,
                  y: 2563
                },
                {
                  x: 2466,
                  y: 2563
                },
                {
                  x: 2466,
                  y: 2642
                },
                {
                  x: 2268,
                  y: 2642
                }
              ]
            ],
            value: '吴晨晨'
          }
        ],
        commodity: [
          [
            {
              id: 1,
              key: '商品名称',
              position: [
                [
                  {
                    x: 342,
                    y: 1421
                  },
                  {
                    x: 1051,
                    y: 1421
                  },
                  {
                    x: 1051,
                    y: 1567
                  },
                  {
                    x: 342,
                    y: 1567
                  }
                ]
              ],
              value: '*黑色金属冶炼压延品*螺纹钢\n*黑色金属冶炼压延品*盘螺'
            },
            {
              id: 2,
              key: '商品规格型号',
              position: [
                [
                  {
                    x: 1182,
                    y: 1432
                  },
                  {
                    x: 1253,
                    y: 1432
                  },
                  {
                    x: 1253,
                    y: 1559
                  },
                  {
                    x: 1182,
                    y: 1559
                  }
                ]
              ],
              value: '22\n8'
            },
            {
              id: 3,
              key: '商品单位',
              position: [
                [
                  {
                    x: 1601,
                    y: 1417
                  },
                  {
                    x: 1672,
                    y: 1417
                  },
                  {
                    x: 1672,
                    y: 1556
                  },
                  {
                    x: 1601,
                    y: 1556
                  }
                ]
              ],
              value: '吨\n吨'
            },
            {
              id: 4,
              key: '商品数量',
              position: [
                [
                  {
                    x: 1927,
                    y: 1421
                  },
                  {
                    x: 2110,
                    y: 1421
                  },
                  {
                    x: 2110,
                    y: 1548
                  },
                  {
                    x: 1927,
                    y: 1548
                  }
                ]
              ],
              value: '4\n14.895'
            },
            {
              id: 5,
              key: '商品单价',
              position: [
                [
                  {
                    x: 2140,
                    y: 1421
                  },
                  {
                    x: 2425,
                    y: 1421
                  },
                  {
                    x: 2425,
                    y: 1537
                  },
                  {
                    x: 2140,
                    y: 1537
                  }
                ]
              ],
              value: '4802.83185840\n5226.69026548'
            },
            {
              id: 6,
              key: '商品金额',
              position: [
                [
                  {
                    x: 2713,
                    y: 1413
                  },
                  {
                    x: 2964,
                    y: 1413
                  },
                  {
                    x: 2964,
                    y: 1541
                  },
                  {
                    x: 2713,
                    y: 1541
                  }
                ]
              ],
              value: '19211.33\n77851.55'
            },
            {
              id: 7,
              key: '商品税率',
              position: [
                [
                  {
                    x: 2987,
                    y: 1410
                  },
                  {
                    x: 3125,
                    y: 1410
                  },
                  {
                    x: 3125,
                    y: 1541
                  },
                  {
                    x: 2987,
                    y: 1541
                  }
                ]
              ],
              value: '13%\n13%'
            },
            {
              id: 8,
              key: '商品税额',
              position: [
                [
                  {
                    x: 3391,
                    y: 1402
                  },
                  {
                    x: 3627,
                    y: 1402
                  },
                  {
                    x: 3627,
                    y: 1541
                  },
                  {
                    x: 3391,
                    y: 1541
                  }
                ]
              ],
              value: '2497.47\n10120.70'
            }
          ]
        ],
        others: [
          {
            id: 1,
            key: '发票联号',
            position: [
              [
                {
                  x: 3650,
                  y: 1305
                },
                {
                  x: 3728,
                  y: 1305
                },
                {
                  x: 3728,
                  y: 1728
                },
                {
                  x: 3650,
                  y: 1728
                }
              ]
            ],
            value: '第二联:抵扣联'
          },
          {
            id: 2,
            key: '备注',
            position: [
              [
                {
                  x: 2349,
                  y: 2203
                },
                {
                  x: 3384,
                  y: 2203
                },
                {
                  x: 3384,
                  y: 2335
                },
                {
                  x: 2349,
                  y: 2335
                }
              ]
            ],
            value: '项目名称：重圳龙湖高新天街钢材供货合同项目地地重庆市沙坪坝区微电园'
          }
        ]
      }
    ],
    angle: 0,
    json: {
      predict_status: 'success',
      trace_id: 'U2024011016570597-20240110163325105',
      predict_result: {
        purchaser_bank: {
          kie_score: 0.9997758865356445,
          bounding_box: [
            {
              x: 848,
              y: 1263
            },
            {
              x: 1904,
              y: 1263
            },
            {
              x: 1904,
              y: 1335
            },
            {
              x: 848,
              y: 1335
            }
          ],
          text: '招商银行重庆江北支行123905776210902'
        },
        check_code_key: {
          kie_score: 0,
          bounding_box: [],
          text: ''
        },
        commodity_price: {
          kie_score: 0.9996539950370789,
          bounding_box: [
            {
              x: 2140,
              y: 1421
            },
            {
              x: 2425,
              y: 1421
            },
            {
              x: 2425,
              y: 1537
            },
            {
              x: 2140,
              y: 1537
            }
          ],
          text: '4802.83185840\n5226.69026548'
        },
        amount_in_figuers: {
          kie_score: 0.9997579455375671,
          bounding_box: [
            {
              x: 2957,
              y: 2099
            },
            {
              x: 3361,
              y: 2099
            },
            {
              x: 3361,
              y: 2162
            },
            {
              x: 2957,
              y: 2162
            }
          ],
          text: '109681.05'
        },
        seller_register_num_key: {
          kie_score: 0.9985873699188232,
          bounding_box: [
            {
              x: 448,
              y: 2391
            },
            {
              x: 818,
              y: 2391
            },
            {
              x: 818,
              y: 2443
            },
            {
              x: 448,
              y: 2443
            }
          ],
          text: '地址、电话:'
        },
        checker: {
          kie_score: 0.9998583793640137,
          bounding_box: [
            {
              x: 1485,
              y: 2567
            },
            {
              x: 1687,
              y: 2567
            },
            {
              x: 1687,
              y: 2649
            },
            {
              x: 1485,
              y: 2649
            }
          ],
          text: '陈俊甫'
        },
        invoice_name: {
          kie_score: 0.9963725805282593,
          bounding_box: [
            {
              x: 1440,
              y: 559
            },
            {
              x: 2425,
              y: 559
            },
            {
              x: 2425,
              y: 676
            },
            {
              x: 1440,
              y: 676
            }
          ],
          text: '重庆增值税专用发票'
        },
        seller_address_key: {
          kie_score: 0.9900872111320496,
          bounding_box: [
            {
              x: 440,
              y: 2230
            },
            {
              x: 818,
              y: 2230
            },
            {
              x: 818,
              y: 2297
            },
            {
              x: 440,
              y: 2297
            }
          ],
          text: '名称：'
        },
        amount_in_figuers_key: {
          kie_score: 0.9985476136207581,
          bounding_box: [
            {
              x: 2713,
              y: 2091
            },
            {
              x: 2916,
              y: 2091
            },
            {
              x: 2916,
              y: 2159
            },
            {
              x: 2713,
              y: 2159
            }
          ],
          text: '(小写)'
        },
        purchaser_address: {
          kie_score: 0.9999431371688843,
          bounding_box: [
            {
              x: 848,
              y: 1173
            },
            {
              x: 2039,
              y: 1173
            },
            {
              x: 2039,
              y: 1241
            },
            {
              x: 848,
              y: 1241
            }
          ],
          text: '重庆市沙坪坝区西永大道28-2号023-67700627'
        },
        payee: {
          kie_score: 0.9999282360076904,
          bounding_box: [
            {
              x: 631,
              y: 2574
            },
            {
              x: 830,
              y: 2574
            },
            {
              x: 830,
              y: 2653
            },
            {
              x: 631,
              y: 2653
            }
          ],
          text: '李超逸'
        },
        purchaser_bank_key: {
          kie_score: 0.9948262572288513,
          bounding_box: [
            {
              x: 429,
              y: 1256
            },
            {
              x: 803,
              y: 1256
            },
            {
              x: 803,
              y: 1320
            },
            {
              x: 429,
              y: 1320
            }
          ],
          text: '开户行及账号:'
        },
        password: {
          kie_score: 0.9996298551559448,
          bounding_box: [
            {
              x: 2327,
              y: 975
            },
            {
              x: 3530,
              y: 975
            },
            {
              x: 3530,
              y: 1305
            },
            {
              x: 2327,
              y: 1305
            }
          ],
          text: '03-5*1*33-76*>883*4725-*-<-029><506>4<>>+6**37++->91-4613*94+048627092<214426/6>/4>9300-0>04<101188/0376/873><46'
        },
        commodity_unit: {
          kie_score: 0.9995721578598022,
          bounding_box: [
            {
              x: 1601,
              y: 1417
            },
            {
              x: 1672,
              y: 1417
            },
            {
              x: 1672,
              y: 1556
            },
            {
              x: 1601,
              y: 1556
            }
          ],
          text: '吨\n吨'
        },
        invoice_date_key: {
          kie_score: 0.9965463280677795,
          bounding_box: [
            {
              x: 2758,
              y: 825
            },
            {
              x: 3047,
              y: 825
            },
            {
              x: 3047,
              y: 889
            },
            {
              x: 2758,
              y: 889
            }
          ],
          text: '开票日期:'
        },
        seller_name: {
          kie_score: 0.999893307685852,
          bounding_box: [
            {
              x: 863,
              y: 2233
            },
            {
              x: 1459,
              y: 2233
            },
            {
              x: 1459,
              y: 2305
            },
            {
              x: 863,
              y: 2305
            }
          ],
          text: '重庆市皇甫物资有限公司'
        },
        purchaser_register_num_key: {
          kie_score: 0.9989079236984253,
          bounding_box: [
            {
              x: 433,
              y: 1076
            },
            {
              x: 800,
              y: 1076
            },
            {
              x: 800,
              y: 1140
            },
            {
              x: 433,
              y: 1140
            }
          ],
          text: '纳税人识别号:'
        },
        invoice_seal: {
          kie_score: 1,
          bounding_box: [
            {
              x: 2405,
              y: 2168
            },
            {
              x: 3081,
              y: 2168
            },
            {
              x: 3081,
              y: 2675
            },
            {
              x: 2405,
              y: 2675
            }
          ],
          text: '有'
        },
        height: 3024,
        commodity_name: {
          kie_score: 0.9998088181018829,
          bounding_box: [
            {
              x: 342,
              y: 1421
            },
            {
              x: 1051,
              y: 1421
            },
            {
              x: 1051,
              y: 1567
            },
            {
              x: 342,
              y: 1567
            }
          ],
          text: '*黑色金属冶炼压延品*螺纹钢\n*黑色金属冶炼压延品*盘螺'
        },
        note_drawer: {
          kie_score: 0.9997037053108215,
          bounding_box: [
            {
              x: 2268,
              y: 2563
            },
            {
              x: 2466,
              y: 2563
            },
            {
              x: 2466,
              y: 2642
            },
            {
              x: 2268,
              y: 2642
            }
          ],
          text: '吴晨晨'
        },
        seller_bank: {
          kie_score: 0.999955952167511,
          bounding_box: [
            {
              x: 867,
              y: 2484
            },
            {
              x: 2081,
              y: 2484
            },
            {
              x: 2081,
              y: 2552
            },
            {
              x: 867,
              y: 2552
            }
          ],
          text: '建行沙坪坝支行上桥分理处50001053700059168168'
        },
        machine_ID: {
          kie_score: 0.9759809374809265,
          bounding_box: [
            {
              x: 582,
              y: 908
            },
            {
              x: 1065,
              y: 908
            },
            {
              x: 1065,
              y: 971
            },
            {
              x: 582,
              y: 971
            }
          ],
          text: '499914700105'
        },
        total_tax: {
          kie_score: 0.9998881816864014,
          bounding_box: [
            {
              x: 3290,
              y: 1990
            },
            {
              x: 3620,
              y: 1990
            },
            {
              x: 3620,
              y: 2042
            },
            {
              x: 3290,
              y: 2042
            }
          ],
          text: '12618.17'
        },
        invoice_num_key: {
          kie_score: 0,
          bounding_box: [],
          text: ''
        },
        total_amount: {
          kie_score: 1,
          bounding_box: [
            {
              x: 2620,
              y: 1990
            },
            {
              x: 2960,
              y: 1990
            },
            {
              x: 2960,
              y: 2054
            },
            {
              x: 2620,
              y: 2054
            }
          ],
          text: '97062.88'
        },
        commodity_tax: {
          kie_score: 0.999900758266449,
          bounding_box: [
            {
              x: 3391,
              y: 1402
            },
            {
              x: 3627,
              y: 1402
            },
            {
              x: 3627,
              y: 1541
            },
            {
              x: 3391,
              y: 1541
            }
          ],
          text: '2497.47\n10120.70'
        },
        checker_key: {
          kie_score: 0.9994781613349915,
          bounding_box: [
            {
              x: 1286,
              y: 2552
            },
            {
              x: 1462,
              y: 2552
            },
            {
              x: 1462,
              y: 2623
            },
            {
              x: 1286,
              y: 2623
            }
          ],
          text: '复核:'
        },
        amount_in_words: {
          kie_score: 0.9999014139175415,
          bounding_box: [
            {
              x: 1245,
              y: 2102
            },
            {
              x: 2069,
              y: 2102
            },
            {
              x: 2069,
              y: 2178
            },
            {
              x: 1245,
              y: 2178
            }
          ],
          text: '壹拾万玖仟陆佰捌拾壹圆零伍分'
        },
        seller_name_key: {
          kie_score: 0.9991573095321655,
          bounding_box: [
            {
              x: 448,
              y: 2308
            },
            {
              x: 815,
              y: 2308
            },
            {
              x: 815,
              y: 2372
            },
            {
              x: 448,
              y: 2372
            }
          ],
          text: '纳税人识别号:'
        },
        invoice_paper: {
          kie_score: 1,
          bounding_box: [
            {
              x: 1440,
              y: 559
            },
            {
              x: 2425,
              y: 559
            },
            {
              x: 2425,
              y: 676
            },
            {
              x: 1440,
              y: 676
            }
          ],
          text: '纸质发票'
        },
        commodity_tax_rate: {
          kie_score: 0.9998980760574341,
          bounding_box: [
            {
              x: 2987,
              y: 1410
            },
            {
              x: 3125,
              y: 1410
            },
            {
              x: 3125,
              y: 1541
            },
            {
              x: 2987,
              y: 1541
            }
          ],
          text: '13%\n13%'
        },
        note: {
          kie_score: 0.9998127967119217,
          bounding_box: [
            {
              x: 2349,
              y: 2203
            },
            {
              x: 3384,
              y: 2203
            },
            {
              x: 3384,
              y: 2335
            },
            {
              x: 2349,
              y: 2335
            }
          ],
          text: '项目名称：重圳龙湖高新天街钢材供货合同项目地地重庆市沙坪坝区微电园'
        },
        other: {
          kie_score: 1,
          bounding_box: [],
          text: ''
        },
        payee_key: {
          kie_score: 0.9991474151611328,
          bounding_box: [
            {
              x: 358,
              y: 2563
            },
            {
              x: 601,
              y: 2563
            },
            {
              x: 601,
              y: 2627
            },
            {
              x: 358,
              y: 2627
            }
          ],
          text: '收款人:'
        },
        invoice_code_key: {
          kie_score: 0,
          bounding_box: [],
          text: ''
        },
        purchaser_name_key: {
          kie_score: 0.9986550807952881,
          bounding_box: [
            {
              x: 418,
              y: 990
            },
            {
              x: 796,
              y: 990
            },
            {
              x: 796,
              y: 1058
            },
            {
              x: 418,
              y: 1058
            }
          ],
          text: '名称:'
        },
        commodity_type: {
          kie_score: 0.9995488822460175,
          bounding_box: [
            {
              x: 1182,
              y: 1432
            },
            {
              x: 1253,
              y: 1432
            },
            {
              x: 1253,
              y: 1559
            },
            {
              x: 1182,
              y: 1559
            }
          ],
          text: '22\n8'
        },
        machine_ID_key: {
          kie_score: 0.9871339201927185,
          bounding_box: [
            {
              x: 579,
              y: 825
            },
            {
              x: 837,
              y: 825
            },
            {
              x: 837,
              y: 893
            },
            {
              x: 579,
              y: 893
            }
          ],
          text: '机器编号:'
        },
        invoice_date: {
          kie_score: 1,
          bounding_box: [
            {
              x: 3050,
              y: 833
            },
            {
              x: 3511,
              y: 833
            },
            {
              x: 3511,
              y: 904
            },
            {
              x: 3050,
              y: 904
            }
          ],
          text: '2021年06月05日'
        },
        seller_bank_key: {
          kie_score: 0.9966728687286377,
          bounding_box: [
            {
              x: 444,
              y: 2454
            },
            {
              x: 826,
              y: 2454
            },
            {
              x: 826,
              y: 2529
            },
            {
              x: 444,
              y: 2529
            }
          ],
          text: '开户行及账号:'
        },
        sheet_num: {
          kie_score: 0.9749139547348022,
          bounding_box: [
            {
              x: 3650,
              y: 1305
            },
            {
              x: 3728,
              y: 1305
            },
            {
              x: 3728,
              y: 1728
            },
            {
              x: 3650,
              y: 1728
            }
          ],
          text: '第二联:抵扣联'
        },
        seller_register_num: {
          kie_score: 0.9994268417358398,
          bounding_box: [
            {
              x: 867,
              y: 2312
            },
            {
              x: 1631,
              y: 2312
            },
            {
              x: 1631,
              y: 2380
            },
            {
              x: 867,
              y: 2380
            }
          ],
          text: '91500106094325593N'
        },
        purchaser_address_key: {
          kie_score: 0.9952900409698486,
          bounding_box: [
            {
              x: 429,
              y: 1174
            },
            {
              x: 800,
              y: 1174
            },
            {
              x: 800,
              y: 1226
            },
            {
              x: 429,
              y: 1226
            }
          ],
          text: '地址、电话:'
        },
        amount_in_words_key: {
          kie_score: 0.9982271790504456,
          bounding_box: [
            {
              x: 492,
              y: 2110
            },
            {
              x: 964,
              y: 2110
            },
            {
              x: 964,
              y: 2174
            },
            {
              x: 492,
              y: 2174
            }
          ],
          text: '价税合计(大写)'
        },
        invoice_num: {
          kie_score: 1,
          bounding_box: [
            {
              x: 2638,
              y: 615
            },
            {
              x: 3620,
              y: 615
            },
            {
              x: 3620,
              y: 803
            },
            {
              x: 2638,
              y: 803
            }
          ],
          text: '07807193'
        },
        purchaser_name: {
          kie_score: 0.9998950958251953,
          bounding_box: [
            {
              x: 848,
              y: 990
            },
            {
              x: 1612,
              y: 990
            },
            {
              x: 1612,
              y: 1061
            },
            {
              x: 848,
              y: 1061
            }
          ],
          text: '重庆龙湖嘉博地产发展有限公司'
        },
        check_code: {
          kie_score: 0,
          bounding_box: [],
          text: ''
        },
        angle: 0,
        supervision_seal: {
          kie_score: 1,
          bounding_box: [
            {
              x: 1696,
              y: 566
            },
            {
              x: 2214,
              y: 566
            },
            {
              x: 2214,
              y: 914
            },
            {
              x: 1696,
              y: 914
            }
          ],
          text: '有'
        },
        invoice_type: {
          kie_score: 1,
          bounding_box: [
            {
              x: 1440,
              y: 559
            },
            {
              x: 2425,
              y: 559
            },
            {
              x: 2425,
              y: 676
            },
            {
              x: 1440,
              y: 676
            }
          ],
          text: '专用发票'
        },
        commodity_num: {
          kie_score: 0.9992427229881287,
          bounding_box: [
            {
              x: 1927,
              y: 1421
            },
            {
              x: 2110,
              y: 1421
            },
            {
              x: 2110,
              y: 1548
            },
            {
              x: 1927,
              y: 1548
            }
          ],
          text: '4\n14.895'
        },
        purchaser_register_num: {
          kie_score: 0.9988535642623901,
          bounding_box: [
            {
              x: 852,
              y: 1080
            },
            {
              x: 1616,
              y: 1080
            },
            {
              x: 1616,
              y: 1148
            },
            {
              x: 852,
              y: 1148
            }
          ],
          text: '915000000682569262'
        },
        note_drawer_key: {
          kie_score: 0.9994733929634094,
          bounding_box: [
            {
              x: 2013,
              y: 2559
            },
            {
              x: 2241,
              y: 2559
            },
            {
              x: 2241,
              y: 2612
            },
            {
              x: 2013,
              y: 2612
            }
          ],
          text: '开票人:'
        },
        seller_address: {
          kie_score: 0.9993060628573099,
          bounding_box: [
            {
              x: 867,
              y: 2383
            },
            {
              x: 2159,
              y: 2383
            },
            {
              x: 2159,
              y: 2484
            },
            {
              x: 867,
              y: 2484
            }
          ],
          text: '重庆市沙坪坝区国际物流枢纽园重铁巨龙钢材市场B区4号楼10213594089818'
        },
        invoice_code: {
          kie_score: 1,
          bounding_box: [
            {
              x: 645,
              y: 641
            },
            {
              x: 1246,
              y: 641
            },
            {
              x: 1246,
              y: 747
            },
            {
              x: 645,
              y: 747
            }
          ],
          text: '5000202130'
        },
        commodity_amount: {
          kie_score: 0.9998742341995239,
          bounding_box: [
            {
              x: 2713,
              y: 1413
            },
            {
              x: 2964,
              y: 1413
            },
            {
              x: 2964,
              y: 1541
            },
            {
              x: 2713,
              y: 1541
            }
          ],
          text: '19211.33\n77851.55'
        },
        width: 4032
      },
      ret_code: 200
    }
  }
]

export { data }
