import exampleTwo from "../../assets/images/document-images/property/示例二.png";
import exampleOne from "../../assets/images/document-images/property/示例一.jpg";

const documents = [
  {
    "name": '示例一.jpg',
    "requestId": "001",
    "pages": [
      {
        "img": exampleOne,
        "pageName": "aaa2861c-9b59-49e2-81cc-7841db21c348.jpg",
        "originalHeight": 2480,
        "originalWidth": 3504,
        "imgRotatingDeg": 0,
        "analysisResult": [
          {
            "id": 1,
            "key": "权利人名称1",
            "value": "李号号",
            "coordinatesList": [[
              {
                "x": 133,
                "y": 257
              },
              {
                "x": 1574,
                "y": 289
              },
              {
                "x": 1573,
                "y": 347
              },
              {
                "x": 132,
                "y": 315
              }
            ]]
          },
          {
            "id": 2,
            "key": "权利人证件号1",
            "value": "440525196800000008",
            "coordinatesList": [[
              {
                "x": 133,
                "y": 257
              },
              {
                "x": 1574,
                "y": 289
              },
              {
                "x": 1573,
                "y": 347
              },
              {
                "x": 132,
                "y": 315
              }
            ]]
          },
          {
            "id": 3,
            "key": "宗地号",
            "value": "A004-0087",
            "coordinatesList": [[
              {
                "x": 359,
                "y": 483
              },
              {
                "x": 596,
                "y": 489
              },
              {
                "x": 594,
                "y": 550
              },
              {
                "x": 358,
                "y": 544
              }
            ]]
          },
          {
            "id": 4,
            "key": "宗地面积",
            "value": "38090.56㎡",
            "coordinatesList": [[
              {
                "x": 1170,
                "y": 506
              },
              {
                "x": 1427,
                "y": 506
              },
              {
                "x": 1427,
                "y": 565
              },
              {
                "x": 1170,
                "y": 565
              }
            ]]
          },
          {
            "id": 5,
            "key": "土地用途",
            "value": "居住用地",
            "coordinatesList": [[
              {
                "x": 356,
                "y": 579
              },
              {
                "x": 576,
                "y": 585
              },
              {
                "x": 574,
                "y": 666
              },
              {
                "x": 354,
                "y": 660
              }
            ]]
          },
          {
            "id": 6,
            "key": "所在区",
            "value": "宝安",
            "coordinatesList": [[
              {
                "x": 1165,
                "y": 597
              },
              {
                "x": 1291,
                "y": 603
              },
              {
                "x": 1288,
                "y": 680
              },
              {
                "x": 1161,
                "y": 674
              }
            ]]
          },
          {
            "id": 7,
            "key": "土地位置",
            "value": "宝安中心区N5区",
            "coordinatesList": [[
              {
                "x": 363,
                "y": 705
              },
              {
                "x": 701,
                "y": 705
              },
              {
                "x": 701,
                "y": 763
              },
              {
                "x": 363,
                "y": 763
              }
            ]]
          },
          {
            "id": 8,
            "key": "使用年限",
            "value": "70年,从2004年07月14日至2074年07月13日止。",
            "coordinatesList": [[
              {
                "x": 359,
                "y": 811
              },
              {
                "x": 1335,
                "y": 834
              },
              {
                "x": 1334,
                "y": 891
              },
              {
                "x": 358,
                "y": 868
              }
            ]]
          },
          {
            "id": 9,
            "key": "房产证书编号",
            "value": "深房地字第50003973",
            "coordinatesList": [[
              {
                "x": 383,
                "y": 1674
              },
              {
                "x": 968,
                "y": 1684
              },
              {
                "x": 967,
                "y": 1752
              },
              {
                "x": 382,
                "y": 1742
              }
            ]]
          },
          {
            "id": 10,
            "key": "登记日期",
            "value": "登记日期2009年09月28日",
            "coordinatesList": [[
              {
                "x": 565,
                "y": 2052
              },
              {
                "x": 1164,
                "y": 2074
              },
              {
                "x": 1162,
                "y": 2135
              },
              {
                "x": 563,
                "y": 2114
              }
            ]]
          },
          {
            "id": 11,
            "key": "建筑面积",
            "value": "130.3㎡",
            "coordinatesList": [[
              {
                "x": 2040,
                "y": 401
              },
              {
                "x": 2222,
                "y": 407
              },
              {
                "x": 2220,
                "y": 467
              },
              {
                "x": 2037,
                "y": 461
              }
            ]]
          },
          {
            "id": 12,
            "key": "套内建筑面积",
            "value": "103.09㎡",
            "coordinatesList": [[
              {
                "x": 2833,
                "y": 417
              },
              {
                "x": 3045,
                "y": 417
              },
              {
                "x": 3045,
                "y": 476
              },
              {
                "x": 2833,
                "y": 476
              }
            ]]
          },
          {
            "id": 13,
            "key": "用途",
            "value": "住宅",
            "coordinatesList": [[
              {
                "x": 2034,
                "y": 498
              },
              {
                "x": 2158,
                "y": 504
              },
              {
                "x": 2154,
                "y": 578
              },
              {
                "x": 2031,
                "y": 573
              }
            ]]
          },
          {
            "id": 14,
            "key": "竣工日期",
            "value": "2006年10月31日",
            "coordinatesList": [[
              {
                "x": 2833,
                "y": 525
              },
              {
                "x": 3182,
                "y": 532
              },
              {
                "x": 3181,
                "y": 592
              },
              {
                "x": 2832,
                "y": 585
              }
            ]]
          },
          {
            "id": 15,
            "key": "登记价",
            "value": "人民币7777775.00元",
            "coordinatesList": [[
              {
                "x": 2043,
                "y": 609
              },
              {
                "x": 2481,
                "y": 618
              },
              {
                "x": 2480,
                "y": 675
              },
              {
                "x": 2042,
                "y": 666
              }
            ]]
          },
          {
            "id": 16,
            "key": "附记",
            "value": "市场商品房。\n该业主于2009年9月25日通过购买取得该房地产。\n以下空白",
            "coordinatesList": [[
              {
                "x": 1752,
                "y": 814
              },
              {
                "x": 2573,
                "y": 814
              },
              {
                "x": 2572,
                "y": 957
              },
              {
                "x": 1750,
                "y": 950
              }
            ]]
          }
        ]
      }
    ]
  }
]
export default documents