import img2 from './image/示例二.jpg'
import img1 from './image/示例一.jpg'

const data = [
  {
    index: 1,
    fileName: '示例1.jpg',
    imagePath: 'product/seal_recognition/lls/T2022051315987509/data/',
    imageUrl: img1,
    height: 1650,
    width: 2598,
    ret: [{
      imageWidth: 166,
      itemVOS: [{
        index: 1,
        polygon: [{
          index: 1,
          x: 1142.6,
          y: 229.8
        },
        {
          index: 2,
          x: 1178.3,
          y: 182.6
        },
        {
          index: 3,
          x: 1256.1,
          y: 157.1
        },
        {
          index: 4,
          x: 1335.8,
          y: 155.2
        },
        {
          index: 5,
          x: 1400.9,
          y: 176.9
        },
        {
          index: 6,
          x: 1444.9,
          y: 228.5
        },
        {
          index: 7,
          x: 1413.6,
          y: 244.5
        },
        {
          index: 8,
          x: 1374.7,
          y: 213.8
        },
        {
          index: 9,
          x: 1332.6,
          y: 198.5
        },
        {
          index: 10,
          x: 1266.3,
          y: 195.3
        },
        {
          index: 11,
          x: 1201.9,
          y: 220.2
        },
        {
          index: 12,
          x: 1175.1,
          y: 253.4
        }
        ],
        id: 1,
        key: '全国统一发票监制章'
      },
      {
        index: 2,
        polygon: [{
          index: 1,
          x: 1210.2,
          y: 235.5
        },
        {
          index: 2,
          x: 1249.7,
          y: 234.9
        },
        {
          index: 3,
          x: 1283.5,
          y: 234.9
        },
        {
          index: 4,
          x: 1323.7,
          y: 234.3
        },
        {
          index: 5,
          x: 1358.8,
          y: 233.6
        },
        {
          index: 6,
          x: 1387.5,
          y: 234.3
        },
        {
          index: 7,
          x: 1389.4,
          y: 273.2
        },
        {
          index: 8,
          x: 1357.5,
          y: 272.5
        },
        {
          index: 9,
          x: 1323.7,
          y: 275.1
        },
        {
          index: 10,
          x: 1284.8,
          y: 274.4
        },
        {
          index: 11,
          x: 1251,
          y: 273.8
        },
        {
          index: 12,
          x: 1209.5,
          y: 275.1
        }
        ],
        id: 2,
        key: '国家税务总局'
      },
      {
        index: 3,
        polygon: [{
          index: 1,
          x: 1194.9,
          y: 286.6
        },
        {
          index: 2,
          x: 1226.8,
          y: 301.2
        },
        {
          index: 3,
          x: 1263.8,
          y: 310.8
        },
        {
          index: 4,
          x: 1304.6,
          y: 310.1
        },
        {
          index: 5,
          x: 1348.6,
          y: 303.8
        },
        {
          index: 6,
          x: 1400.9,
          y: 284
        },
        {
          index: 7,
          x: 1422.6,
          y: 315.9
        },
        {
          index: 8,
          x: 1363.3,
          y: 345.2
        },
        {
          index: 9,
          x: 1303.9,
          y: 351.6
        },
        {
          index: 10,
          x: 1261.8,
          y: 350.3
        },
        {
          index: 11,
          x: 1214,
          y: 338.2
        },
        {
          index: 12,
          x: 1179.6,
          y: 317.2
        }
        ],
        id: 3,
        key: '深圳市税务局'
      }
      ],
      index: 1,
      sealType: '椭圆章',
      imageHeight: 125,
      rectangle: [{
        index: 1,
        x: 1109.0,
        y: 131.0
      }, {
        index: 2,
        x: 1109.0,
        y: 377.0
      }, {
        index: 3,
        x: 1486.0,
        y: 377.0
      }, {
        index: 4,
        x: 1486.0,
        y: 131.0
      }]
    },
    {
      imageWidth: 166,
      itemVOS: [{
        index: 1,
        polygon: [{
          index: 1,
          x: 1928.7,
          y: 1546.3
        },
        {
          index: 2,
          x: 1902.8,
          y: 1373.5
        },
        {
          index: 3,
          x: 2070.3,
          y: 1269.2
        },
        {
          index: 4,
          x: 2271.8,
          y: 1307
        },
        {
          index: 5,
          x: 2356.7,
          y: 1449
        },
        {
          index: 6,
          x: 2308.8,
          y: 1543.8
        },
        {
          index: 7,
          x: 2260,
          y: 1507.3
        },
        {
          index: 8,
          x: 2293.7,
          y: 1431.9
        },
        {
          index: 9,
          x: 2234.3,
          y: 1362.5
        },
        {
          index: 10,
          x: 2080.5,
          y: 1331.1
        },
        {
          index: 11,
          x: 1951.6,
          y: 1421.5
        },
        {
          index: 12,
          x: 1979.9,
          y: 1522.1
        }
        ],
        id: 4,
        key: '深圳粤涛汽车服务有限公司'
      },
      {
        index: 2,
        polygon: [{
          index: 1,
          x: 1963.1,
          y: 1428.9
        },
        {
          index: 2,
          x: 2029.2,
          y: 1427.6
        },
        {
          index: 3,
          x: 2093.4,
          y: 1425.8
        },
        {
          index: 4,
          x: 2161.3,
          y: 1425.8
        },
        {
          index: 5,
          x: 2225.6,
          y: 1425.8
        },
        {
          index: 6,
          x: 2282.6,
          y: 1424.6
        },
        {
          index: 7,
          x: 2284.4,
          y: 1468.3
        },
        {
          index: 8,
          x: 2227.4,
          y: 1471.3
        },
        {
          index: 9,
          x: 2161.3,
          y: 1471.9
        },
        {
          index: 10,
          x: 2093.4,
          y: 1470.1
        },
        {
          index: 11,
          x: 2029.8,
          y: 1473.1
        },
        {
          index: 12,
          x: 1964.3,
          y: 1475.5
        }
        ],
        id: 5,
        key: '91440300MA5D9HRJ6W'
      },
      {
        index: 3,
        polygon: [{
          index: 1,
          x: 2024,
          y: 1497.9
        },
        {
          index: 2,
          x: 2064.5,
          y: 1497.9
        },
        {
          index: 3,
          x: 2107.9,
          y: 1497.9
        },
        {
          index: 4,
          x: 2144.6,
          y: 1497.9
        },
        {
          index: 5,
          x: 2189,
          y: 1496
        },
        {
          index: 6,
          x: 2229.5,
          y: 1496
        },
        {
          index: 7,
          x: 2235.3,
          y: 1571.2
        },
        {
          index: 8,
          x: 2190.9,
          y: 1572.2
        },
        {
          index: 9,
          x: 2145.6,
          y: 1572.2
        },
        {
          index: 10,
          x: 2105,
          y: 1571.2
        },
        {
          index: 11,
          x: 2063.6,
          y: 1568.3
        },
        {
          index: 12,
          x: 2021.1,
          y: 1567.4
        }
        ],
        id: 6,
        key: '发票专用章'
      }
      ],
      index: 2,
      sealType: '椭圆章',
      imageHeight: 125,
      rectangle: [{
        index: 1,
        x: 1857.0,
        y: 1255.0
      }, {
        index: 2,
        x: 1857.0,
        y: 1634.0
      }, {
        index: 3,
        x: 2386.0,
        y: 1634.0
      }, {
        index: 4,
        x: 2386.0,
        y: 1255.0
      }]
    }
    ]
  },
  {
    index: 2,
    fileName: '示例二.jpg',
    originalImagePath: '/home/lls_data/product/seal_recognition/lls/T2022051114476594/data/',
    imageUrl: img2,
    height: 1536.0,
    width: 2368.0,
    ret: [{
      index: 1,
      sealType: '椭圆章',
      imageHeight: 538.0,
      imageWidth: 709.0,
      rectangle: [{
        index: 1,
        x: 1137.0,
        y: 998.0
      }, {
        index: 2,
        x: 1137.0,
        y: 1536.0
      }, {
        index: 3,
        x: 1846.0,
        y: 1536.0
      }, {
        index: 4,
        x: 1846.0,
        y: 998.0
      }],
      itemVOS: [{
        index: 1,
        id: 1,
        key: '深圳沙河医院预防保健科',
        polygon: [{
          index: 1,
          x: 1167.3931747957604,
          y: 1364.307480931282
        }, {
          index: 2,
          x: 1183.1409184485674,
          y: 1214.9358541965485
        }, {
          index: 3,
          x: 1305.3333878715832,
          y: 1087.7611796855927
        }, {
          index: 4,
          x: 1474.3506784439087,
          y: 1032.1099216938019
        }, {
          index: 5,
          x: 1646.9741999308267,
          y: 1040.809662302335
        }, {
          index: 6,
          x: 1834.1556588399042,
          y: 1195.0808890461922
        }, {
          index: 7,
          x: 1725.368913001621,
          y: 1258.1787350177765
        }, {
          index: 8,
          x: 1602.0836436748505,
          y: 1167.3509969711304
        }, {
          index: 9,
          x: 1495.5525637070336,
          y: 1163.6791522900264
        }, {
          index: 10,
          x: 1385.772614876429,
          y: 1204.2607359091442
        }, {
          index: 11,
          x: 1304.1184076070786,
          y: 1277.6160717010498
        }, {
          index: 12,
          x: 1292.6327780497443,
          y: 1360.007159948349
        }]
      }, {
        index: 2,
        id: 2,
        key: '疫苗接种专用章',
        polygon: [{
          index: 1,
          x: 1239.731003259875,
          y: 1371.9642219543457
        }, {
          index: 2,
          x: 1360.3376043240228,
          y: 1333.369282325109
        }, {
          index: 3,
          x: 1447.6874039967854,
          y: 1311.858089288076
        }, {
          index: 4,
          x: 1535.1970016558964,
          y: 1288.1560370127359
        }, {
          index: 5,
          x: 1623.8713891506195,
          y: 1264.9818766117096
        }, {
          index: 6,
          x: 1750.73367923068,
          y: 1235.2783224582672
        }, {
          index: 7,
          x: 1792.5230751430865,
          y: 1343.8208701610565
        }, {
          index: 8,
          x: 1668.255279858907,
          y: 1378.0714604059854
        }, {
          index: 9,
          x: 1581.010396917661,
          y: 1403.4055244127908
        }, {
          index: 10,
          x: 1493.1417890787125,
          y: 1429.476708730062
        }, {
          index: 11,
          x: 1403.6554801861444,
          y: 1453.8092896143594
        }, {
          index: 12,
          x: 1281.648338868446,
          y: 1482.9680310487747
        }]
      }]
    }]
  }
]

export { data }
