
import imagePath from '../images/financial_statement.png'

const data =
  [
    {
      height: 895,
      width: 1671,
      isexample: true,
      taskId: 'U2024011017526735',
      status: 1,
      fileName: 'financial_statement.png',
      bank: '浙商银行',
      imagePath,
      content: [
        {
          row: 0,
          columns: [
            '交易日期',
            '交易时间',
            '借方金额',
            '贷方金额',
            '余额',
            '币种',
            '交易对手名称',
            '交易对手账号',
            '交易对手银行名称',
            '银行流水号',
            '交易类型',
            '用途',
            '备注',
            '附言',
            '摘要',
            '凭证号',
            '凭证种类',
            '单位结算卡号',
            '企业流水号',
            '交易介质编号',
            '交易时间戳',
            '借贷标志',
            '联行号'
          ]
        },
        {
          row: 1,
          columns: [
            '2022-03-21',
            '02:42',
            '',
            '+0.73',
            '850.74',
            '人民币',
            '',
            '',
            '',
            '',
            '',
            '对公普通活期按季结息',
            '',
            '对公普通活期按季结息',
            '收息',
            '',
            '普通凭证',
            '',
            '',
            '',
            '',
            '',
            ''
          ]
        },
        {
          row: 1,
          columns: [
            '2022-03-10',
            ' 11:56',
            '',
            '+0.01',
            '850.01',
            '人民币',
            '科技集团有限公司',
            '1086000000057',
            '',
            '',
            '',
            '资金调拔',
            '',
            '资金调拔',
            'e转入',
            '',
            '普通凭证',
            '',
            '',
            '',
            '',
            '',
            ''
          ]
        },
        {
          row: 1,
          columns: [
            '2022-02-11',
            '10:21',
            '-100.00',
            '',
            '850.00',
            '人民币',
            '',
            '',
            '',
            '',
            '',
            '',
            '',
            '',
            '手续费',
            '',
            '普通凭证',
            '',
            '',
            '',
            '',
            '',
            ''
          ]
        }
      ],
    }
  ]

export { data }
